#include <stdio.h>
#include <stdlib.h>

int main()
{
    float a,b;                              /* Οι μετεβλητές των 2 αριθμών στους οποίους θα γίνει η πράξη */
    char ch;                                /* Η μεταβλητή του συμβόλου της πράξης */
    printf("Dwse arithmo praji arithmo: "); /* Μήνυμα εισόδου */
    scanf("%f %c %f", &a,&ch,&b);           /* Εισαγωγή των αριθμών και του συμβόλου της πράξης από το πληκτρολόγιο */
    if (ch=='+')                            /* Έλεγχος εάν το σύμβολο είναι πρόσθεση */
    {
        printf("apotelesma %f", a+b);       /* Υπολογισμός αθροίσματος */
    }
    else if (ch=='-')                       /* Έλεγχος εάν το σύμβολο είναι αφαίρεση */
        {
            printf("apotelesma %f", a-b);   /* Υπολογισμός αφαίρεσης */
        }
    else if (ch=='*')                       /* Έλεγχος εάν το σύμβολο είναι πολλαπλασιασμός */
        {
            printf("apotelesma %f", a*b);   /* Υπολογισμός γινομένου */
        }
    else if ((ch=='/') && (b!=0))           /* Έλεγχος εάν το σύμβολο είναι διαίρεση καθώς και εάν ο διαιρέτης είναι διάφορος του μηδενός */
        {
            printf("apotelesma %f", a/b);   /* Υπολογισμός πηλίκου διάρεσης */
        }
    else if ((ch=='/') && (b==0))           /* Έλεγχος εάν το σύμβολο είναι διαίρεση καθώς και εάν ο διαιρέτης είναι ίσος του μηδενός */
        {
            printf("Sfalma! Diairesi me to mhden!"); /* Μήνυμα σφάλματος διαίρεσης με το μηδέν */
            exit(1);                        /* Έξοδος από το πρόγραμμα */
        }
    else {
        printf("Lathos praji");             /* Μήνυμα σφάλματος σε περίπτωση που το σύμβολο της πράξης είναι οτιδήποτε άλλο */
    }
    return 0;
}
